Repository: CyberTailor/vk-stats
Catalog: locale/*/LC_MESSAGES/vk_stats.po
Languages: ru

source: Computing rating of activity in VK groups. [] = default values
ru: Вычисление рейтинга активности в группах ВКонтакте. [] = значения по умолчанию

source: smth where the program will gather stats
ru: что-нибудь, где программа будет собирать статистику

source: check for updates
ru: проверить наличие обновлений

source: specify a mode of stats [posts]
ru: выбрать режим сбора статистики [посты]

source: get access to the VK
ru: получить доступ к ВКонтакте

source: set a number of posts to scan [all]
ru: задать количество постов для сканирования [все]

source: the earliest date of post in the yyyy/mm/dd format [0/0/0]
ru: дата самого раннего поста в формате гггг/мм/дд [0/0/0]

source: Creating a temporary directory...
ru: Создаю временную папку...

source: Downloading the new version...
ru: Скачиваю новую версию...

source: Unpacking an archive...
ru: Распаковываю архив...

source: Please, upgrade the program using package manager or installer
ru: Пожалуйста, используйте менеджер пакетов или установщик.

source: Can't upgrade
ru: Невозможно обновить программу

source: Exiting...
ru: Завершаю работу приложения...

source: Found the update to version {}! Changelog:
ru: Найдено обновление до версии {}! Список изменений:

source: Upgrade? (Y/n)
ru: Обновиться? (Д/н)

source: Passing the update...
ru: В следующий раз обязательно обновись!

source: You running the latest version
ru: Вы используете последнюю версию

source: If you're afraid of losing the account, then: 1) Go to http://vk.cc/3T1J9A 2) Login and give permissions to app 3) Copy part of an urlbar, which is containing the access_token 4) Create a file 'token.txt' in home directory and write to one your access token
ru: Если боитесь потерять аккаунт, то: 1) Пройдите по http://vk.cc/3T1J9A 2) Залогиньтесь и дайте разрешения приложению 3) Скопируйте часть адресной строки, которая содержит access_token 4) Создайте файл 'token.txt' в домашней папке пользователя и запишите в него ваш access_token

source: Your login:
ru: Ваш логин:

source: Your password:
ru: Ваш пароль:

source: Error: {}. Waiting for 10 seconds...
ru: Ошибка: {}. Жду 10 секунд...

source: Limited to {} posts
ru: Ограничено до {} постов

source: Incorrect date!
ru: Неправильная дата!

source: Limited to {} date
ru: Ограничено до даты {}

source: Reached the limit for date.
ru: Достигнуто ограничение по дате.

source: Getting posts: {}%
ru: Получение списка постов: {}%

source: Processing posts: {}%
ru: Обработка постов: {}%

source: Getting list of users: {}%
ru: Получение списка пользователей: {}%

source: Getting likers: {}%
ru: Получение списка лайкеров: {}%

source: Processing user: {}%
ru: Обработка пользователей: {}%

source: Exporting to: {}/results/{} & csv
ru: Экспорт в: {}/results/{} и csv

source: Name
ru: Имя

source: Count
ru: Количество

source: STATISTICS FOR {}
ru: СТАТИСТИКА ПО {}

source: STARTED GATHERING STATS FROM '{}'
ru: НАЧАТ СБОР СТАТИСТИКИ С '{}'

source: SUCCESSFUL!
ru: УСПЕШНО!

source: Error
ru: Ошибка

source: Unknown error
ru: Неизвестная ошибка

source: Please, complete a URL of the group.
ru: Пожалуйста, дополните URL-адрес группы.

source: posts
ru: посты

source: likes
ru: лайки

source: Login:
ru: Логин:

source: Password:
ru: Пароль:

source: Account
ru: Аккаунт

source: All the OK
ru: Всё ОК

source: Authorization
ru: Авторизация

source: Computing rating of activity in VK walls.
ru: Вычисление рейтинга активности в группах ВКонтакте.

source: Date:
ru: Дата:

source: Edit
ru: Правка

source: File
ru: Файл

source: Found update!
ru: Найдено обновление!

source: Go!
ru: Поехали!

source: Help
ru: Справка

source: Likers
ru: Лайкеры

source: Likes
ru: Лайки

source: Log in
ru: Войти

source: Mode:
ru: Режим:

source: Posts
ru: Посты

source: Posts:
ru: Посты:

source: Re-login
ru: Перезайти

source: See files in "results" directory.
ru: Смотрите файлы в папке "results".

source: Successfully!
ru: Успешно!

source: To version: {}. Upgrade?
ru: До версии: {}. Обновиться?

source: Update
ru: Обновление

source: Updates not found
ru: Обновлений не найдено!

source: VKontakte group
ru: Группа ВКонтакте

source: You logged in as {}.
ru: Вы авторизованы как {}.

source: You running the latest version.
ru: Вы используете последнюю версию.

source: all by default
ru: все по умолчанию

source: yyyy/mm/dd
ru: гггг/мм/дд
